laboratories/laboratory_1/1093589207/1093589207/README.md
```mermaid
classDiagram
    class NotificationChannel {
        <<Abstract>>
        -next_channel: NotificationChannel
        -logger: NotificationLogger
        +set_next(channel: NotificationChannel)
        +notify(user: str, message: str, priority: str): bool
        #_send(user: str, message: str, priority: str)*: bool
    }

    class EmailChannel {
        #_send(user: str, message: str, priority: str): bool
    }

    class SMSChannel {
        #_send(user: str, message: str, priority: str): bool
    }

    class ConsoleChannel {
        #_send(user: str, message: str, priority: str): bool
    }

    class NotificationLogger {
        -_instance: NotificationLogger
        -logger: Logger
        +info(message: str)
        +error(message: str)
        +warning(message: str)
    }

    class User {
        +name: str
        +preferred_channel: str
        +available_channels: List[str]
    }

    class NotificationService {
        -users: Dict[str, User]
        -logger: NotificationLogger
        +register_user(name: str, preferred_channel: str, available_channels: List[str]): bool
        +get_users(): List[Dict]
        +send_notification(user_name: str, message: str, priority: str): bool
    }

    NotificationChannel <|-- EmailChannel
    NotificationChannel <|-- SMSChannel
    NotificationChannel <|-- ConsoleChannel
    NotificationChannel --> NotificationLogger
    NotificationService --> NotificationLogger
    NotificationService --> User
    NotificationService --> NotificationChannel

```
